mermaid init
